spec/fixtures/services/ad_group_criterion/get-req.xml

<?xml version='1.0' encoding='UTF-8'?> 
<env:Envelope xmlns:xsd='http://www.w3.org/2001/XMLSchema' xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance' xmlns:env='http://schemas.xmlsoap.org/soap/envelope/' xmlns='https://adwords.google.com/api/adwords/cm/v200909' xmlns:s='https://adwords.google.com/api/adwords/cm/v200909'>
  <env:Header>
    <s:RequestHeader env:mustUnderstand='0'>
      <authToken>
        ***censured***
      </authToken>
      <userAgent>
        Sem4r Adwords Ruby Client Library (http://github.com/sem4r/sem4r)
      </userAgent>
      <developerToken>***censured***</developerToken>
      <clientEmail>
        client_1+sem4ruby@gmail.com
      </clientEmail>
    </s:RequestHeader>
  </env:Header>
  <env:Body>
    <get xmlns='https://adwords.google.com/api/adwords/cm/v200909'>
      <selector>
        <idFilters>
          <adGroupId>
            3060217923
          </adGroupId>
        </idFilters>
      </selector>
    </get>
  </env:Body>
</env:Envelope>
